Problem.org
#+title: Problem
#+date: [2025-12-08 Mon 16:56]

I have moved Doom config out of dotfiles.org into doom.org for easier indexing and searching. Can you make sure that it is tangled properly with the tangle.sh script like dotfiles.org is.

* What needs fixing
+ Links to heading are not recognised (ID links)
+ SPC n s (searching) is not working. No result shows.
+ Hugo related heading metadata isn't generated and added.
