.site/content/notes/Problem.md
+++
title = "Problem"
author = ["James"]
date = 2025-12-08T16:56:00+00:00
draft = false
+++

I have moved Doom config out of dotfiles.org into doom.org for easier indexing and searching. Can you make sure that it is tangled properly with the tangle.sh script like dotfiles.org is.


## What needs fixing {#what-needs-fixing}

-   Links to heading are not recognised (ID links)
-   SPC n s (searching) is not working. No result shows.
-   Hugo related heading metadata isn't generated and added.
